In [9]:
import pandas as pd
import numpy as np
x = [np.nan,1,2,3,4,5]

In [10]:
y = pd.Series([x[np.random.randint(0,6)]for i in range(20)])

In [12]:
print(y.isnull().sum())

5

In [14]:
y.dropna(inplace=True)

In [15]:
print(y)

0     5.0
1     2.0
3     1.0
4     5.0
5     3.0
6     1.0
8     3.0
9     4.0
10    1.0
13    4.0
14    2.0
15    4.0
16    4.0
17    3.0
18    1.0
dtype: float64

In [16]:
print(y.mean())

2.8666666666666667

In [17]:
y.fillna(y.mean())

0     5.0
1     2.0
3     1.0
4     5.0
5     3.0
6     1.0
8     3.0
9     4.0
10    1.0
13    4.0
14    2.0
15    4.0
16    4.0
17    3.0
18    1.0
dtype: float64

# pandas p.11 실습1

In [18]:
import pandas as pd
import numpy as np
x = [np.nan,1,2,3,4,5]
y = pd.Series([x[np.random.randint(0,6)]for i in range(20)])
y

0     2.0
1     4.0
2     4.0
3     4.0
4     NaN
5     4.0
6     2.0
7     NaN
8     2.0
9     1.0
10    3.0
11    3.0
12    4.0
13    3.0
14    3.0
15    1.0
16    1.0
17    5.0
18    4.0
19    4.0
dtype: float64

In [20]:
y.isnull().sum()

2

In [21]:
y.dropna()

0     2.0
1     4.0
2     4.0
3     4.0
5     4.0
6     2.0
8     2.0
9     1.0
10    3.0
11    3.0
12    4.0
13    3.0
14    3.0
15    1.0
16    1.0
17    5.0
18    4.0
19    4.0
dtype: float64

In [23]:
y.mean()

3.0

In [24]:
y.fillna(y.mean())

0     2.0
1     4.0
2     4.0
3     4.0
4     3.0
5     4.0
6     2.0
7     3.0
8     2.0
9     1.0
10    3.0
11    3.0
12    4.0
13    3.0
14    3.0
15    1.0
16    1.0
17    5.0
18    4.0
19    4.0
dtype: float64

In [25]:
y.bfill()

0     2.0
1     4.0
2     4.0
3     4.0
4     4.0
5     4.0
6     2.0
7     2.0
8     2.0
9     1.0
10    3.0
11    3.0
12    4.0
13    3.0
14    3.0
15    1.0
16    1.0
17    5.0
18    4.0
19    4.0
dtype: float64

In [26]:
y[0] = np.nan
y

0     NaN
1     4.0
2     4.0
3     4.0
4     NaN
5     4.0
6     2.0
7     NaN
8     2.0
9     1.0
10    3.0
11    3.0
12    4.0
13    3.0
14    3.0
15    1.0
16    1.0
17    5.0
18    4.0
19    4.0
dtype: float64

In [27]:
y.ffill()

0     NaN
1     4.0
2     4.0
3     4.0
4     4.0
5     4.0
6     2.0
7     2.0
8     2.0
9     1.0
10    3.0
11    3.0
12    4.0
13    3.0
14    3.0
15    1.0
16    1.0
17    5.0
18    4.0
19    4.0
dtype: float64

In [28]:
y[-1] = np.nan
y

 0     NaN
 1     4.0
 2     4.0
 3     4.0
 4     NaN
 5     4.0
 6     2.0
 7     NaN
 8     2.0
 9     1.0
 10    3.0
 11    3.0
 12    4.0
 13    3.0
 14    3.0
 15    1.0
 16    1.0
 17    5.0
 18    4.0
 19    4.0
-1     NaN
dtype: float64

In [29]:
y.bfill()

 0     4.0
 1     4.0
 2     4.0
 3     4.0
 4     4.0
 5     4.0
 6     2.0
 7     2.0
 8     2.0
 9     1.0
 10    3.0
 11    3.0
 12    4.0
 13    3.0
 14    3.0
 15    1.0
 16    1.0
 17    5.0
 18    4.0
 19    4.0
-1     NaN
dtype: float64

In [30]:
sales_data = {
'연도':[2015, 2016, 2017, 2018, 2019, 2020],
'판매량':[103, 70, 130, 160, 190, 230],
'매출':[500000, 300000, 400000, 550000, 700000, 680000],
'순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}
sales_data

{'연도': [2015, 2016, 2017, 2018, 2019, 2020],
 '판매량': [103, 70, 130, 160, 190, 230],
 '매출': [500000, 300000, 400000, 550000, 700000, 680000],
 '순이익': [370000, 190000, 300000, 480000, 600000, 590000]}

In [32]:
df =  pd.DataFrame(sales_data)

In [33]:
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [34]:
df.head(2)

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000

In [35]:
df.tail(3)

     연도  판매량      매출     순이익
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [37]:
df['판매량']

0    103
1     70
2    130
3    160
4    190
5    230
Name: 판매량, dtype: int64

In [38]:
type(df['판매량'])

pandas.core.series.Series

In [39]:
df.iloc[1]

연도       2016
판매량        70
매출     300000
순이익    190000
Name: 1, dtype: int64

In [40]:
df.iloc[1].index

Index(['연도', '판매량', '매출', '순이익'], dtype='object')

In [44]:
pd.DataFrame(sales_data,columns = ['판매량', '매출', '순이익'],index = df['연도'])

      판매량      매출     순이익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018  160  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [43]:
pd.DataFrame(df,columns = ['판매량', '매출', '순이익'])

   판매량      매출     순이익
0  103  500000  370000
1   70  300000  190000
2  130  400000  300000
3  160  550000  480000
4  190  700000  600000
5  230  680000  590000

In [46]:
df = pd.read_csv("sales_data.csv", header = 0)

In [47]:
df

     연도  판매량      매출      순익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018   60  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [48]:
df = pd.read_csv("sales_data.csv", index_col = '연도', header= 0)

In [49]:
df

      판매량      매출      순익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018   60  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [50]:
df.to_csv('sales_data_save.csv')

In [52]:
df = pd.rea_csv('sales_data_save.csv', encoding = 'utf-8')

AttributeError: module 'pandas' has no attribute 'rea_csv'

In [53]:
sales_data = {
'연도':[2015, 2016, 2017, 2018, 2019, 2020],
'판매량':[103, 70, 130, 160, 190, 230],
'매출':[500000, 300000, 400000, 550000, 700000, 680000],
'순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}
sales_data

{'연도': [2015, 2016, 2017, 2018, 2019, 2020],
 '판매량': [103, 70, 130, 160, 190, 230],
 '매출': [500000, 300000, 400000, 550000, 700000, 680000],
 '순이익': [370000, 190000, 300000, 480000, 600000, 590000]}

In [56]:
df = pd.DataFrame(sales_data)
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [58]:
df['순이익률'] = (df['순이익']/df['매출'])*100
df

     연도  판매량      매출     순이익       순이익률
0  2015  103  500000  370000  74.000000
1  2016   70  300000  190000  63.333333
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706

In [59]:
def check(n) :
    if n > 80 :
        return '높음'
    else :
        return '낮음'

In [ ]:
lambda x : '높음' if x > 80  else '낮음'

In [68]:
df['순이익율_비교'] = df['순이익률'].apply(lambda x : '높음' if x > 80  else '낮음')
df

     연도  판매량      매출     순이익       순이익률 순이익율_비교
0  2015  103  500000  370000  74.000000      낮음
1  2016   70  300000  190000  63.333333      낮음
2  2017  130  400000  300000  75.000000      낮음
3  2018  160  550000  480000  87.272727      높음
4  2019  190  700000  600000  85.714286      높음
5  2020  230  680000  590000  86.764706      높음

In [69]:
del df['순이익율_비교']
df

     연도  판매량      매출     순이익       순이익률
0  2015  103  500000  370000  74.000000
1  2016   70  300000  190000  63.333333
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706

In [70]:
df[df['매출']>300000]

     연도  판매량      매출     순이익       순이익률
0  2015  103  500000  370000  74.000000
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706

In [71]:
df['테스트1'] = np.where(df['판매량']>200,0,df['판매량'])

In [73]:
df

     연도  판매량      매출     순이익       순이익률  테스트1
0  2015  103  500000  370000  74.000000   103
1  2016   70  300000  190000  63.333333    70
2  2017  130  400000  300000  75.000000   130
3  2018  160  550000  480000  87.272727   160
4  2019  190  700000  600000  85.714286   190
5  2020  230  680000  590000  86.764706     0

In [74]:
df['테스트2'] = df[df['판매량']<100]['판매량']

In [75]:
df[df['판매량']<100]

     연도  판매량      매출     순이익       순이익률  테스트1  테스트2
1  2016   70  300000  190000  63.333333    70  70.0

In [76]:
df['테스트2'] = df[df['판매량']<100]['판매량']+50

In [77]:
df[df['판매량']<100]['판매량']

1    70
Name: 판매량, dtype: int64

In [78]:
df['테스트2'] = df[df['판매량']<150]['판매량']+50

In [79]:
df[df['판매량']<150]['판매량']

0    103
1     70
2    130
Name: 판매량, dtype: int64

In [80]:
df

     연도  판매량      매출     순이익       순이익률  테스트1   테스트2
0  2015  103  500000  370000  74.000000   103  153.0
1  2016   70  300000  190000  63.333333    70  120.0
2  2017  130  400000  300000  75.000000   130  180.0
3  2018  160  550000  480000  87.272727   160    NaN
4  2019  190  700000  600000  85.714286   190    NaN
5  2020  230  680000  590000  86.764706     0    NaN

In [81]:
df = pd.DataFrame(sales_data)
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [82]:
df.loc[6] = [2021,720,650000,720000]
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000
6  2021  720  650000  720000

In [83]:
df.loc[7] = df.loc[5] +100
df

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000
6  2021  720  650000  720000
7  2120  330  680100  590100

In [84]:
df['순이익률'] = (df['순이익']/df['매출'])*100
df
df['순이익율_비교'] = df['순이익률'].apply(lambda x : '높음' if x > 80  else '낮음')
df

     연도  판매량      매출     순이익        순이익률 순이익율_비교
0  2015  103  500000  370000   74.000000      낮음
1  2016   70  300000  190000   63.333333      낮음
2  2017  130  400000  300000   75.000000      낮음
3  2018  160  550000  480000   87.272727      높음
4  2019  190  700000  600000   85.714286      높음
5  2020  230  680000  590000   86.764706      높음
6  2021  720  650000  720000  110.769231      높음
7  2120  330  680100  590100   86.766652      높음

In [86]:
del df['순이익율_비교']
df

     연도  판매량      매출     순이익        순이익률
0  2015  103  500000  370000   74.000000
1  2016   70  300000  190000   63.333333
2  2017  130  400000  300000   75.000000
3  2018  160  550000  480000   87.272727
4  2019  190  700000  600000   85.714286
5  2020  230  680000  590000   86.764706
6  2021  720  650000  720000  110.769231
7  2120  330  680100  590100   86.766652

In [93]:
df.drop(['순이익률'], axis = 'columns')
df

     연도  판매량      매출     순이익        순이익률
0  2015  103  500000  370000   74.000000
1  2016   70  300000  190000   63.333333
2  2017  130  400000  300000   75.000000
3  2018  160  550000  480000   87.272727
4  2019  190  700000  600000   85.714286
5  2020  230  680000  590000   86.764706
6  2021  720  650000  720000  110.769231
7  2120  330  680100  590100   86.766652

In [96]:
df.drop(df.columns[[0,2]],axis = 1)

   판매량     순이익        순이익률
0  103  370000   74.000000
1   70  190000   63.333333
2  130  300000   75.000000
3  160  480000   87.272727
4  190  600000   85.714286
5  230  590000   86.764706
6  720  720000  110.769231
7  330  590100   86.766652

In [97]:
df.drop (0,inplace=True)

In [98]:
df

     연도  판매량      매출     순이익        순이익률
1  2016   70  300000  190000   63.333333
2  2017  130  400000  300000   75.000000
3  2018  160  550000  480000   87.272727
4  2019  190  700000  600000   85.714286
5  2020  230  680000  590000   86.764706
6  2021  720  650000  720000  110.769231
7  2120  330  680100  590100   86.766652

In [99]:
df.drop (0,inplace=True)
df
# 인덱스 0 이 없기 때문에 에러가 뜸(이전에 인덱스 0을 지웠기 때문)

KeyError: '[0] not found in axis'

In [100]:
df = pd.DataFrame(np.random.randint(1,100,size=(4,4)), index = [['A','A','B','B'],['a','a','b','b']],columns = [['가가','가가','나나','나나'],['가','나','가','나']])

In [101]:
df

     가가      나나
      가   나   가   나
A a  90  32  91  44
  a  70  73  54  25
B b  64  84  64   8
  b  72  81  62  52

In [102]:
df.index

MultiIndex([('A', 'a'),
            ('A', 'a'),
            ('B', 'b'),
            ('B', 'b')],
           )

In [103]:
df.columns

MultiIndex([('가가', '가'),
            ('가가', '나'),
            ('나나', '가'),
            ('나나', '나')],
           )

In [104]:
df = pd.DataFrame(np.random.randint(1,100, size=(15,3)),index = [['1학년','1학년','1학년','1학년','1학년','2학년','2학년','2학년','2학년','2학년','3학년','3학년','3학년','3학년','3학년'],['1반','2반','3반','4반','5반','1반','2반','3반','4반','5반','1반','2반','3반','4반','5반']],columns=['국어','영어','과학'])
df

        국어  영어  과학
1학년 1반  53  63  55
    2반  58  32   7
    3반   5  73  66
    4반   5  50  51
    5반  73  70   3
2학년 1반  91  99  71
    2반  20  77  32
    3반  57  88  72
    4반  71   9  67
    5반  84  44   1
3학년 1반  23  49  42
    2반  68   3  96
    3반  24  56  14
    4반  80  23  72
    5반  64  90   3